case/PCM-MF_15-20MPa/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

rho             	rho [1 -3 0 0 0 0 0] 773;

// liquid density polynomial (rho_L=rho_La+rho_Lb*(T-TRef_rho_L)+rho_Lc*(T-TRef_rho_L)^2)
TRef_rho_L			TRef_rho_L [0 0 0 1 0 0 0] 287.81;
rho_La				rho_La [1 -3 0 0 0 0 0] 773;
rho_Lb				rho_Lb [1 -3 0 -1 0 0 0] -0.6625;
rho_Lc				rho_Lc [1 -3 0 -2 0 0 0] 0;
rho_Ld				rho_Ld [1 -3 0 -2.5 0 0 0] 0;
rho_Le				rho_Le [1 -3 0 -3 0 0 0] 0;

// liquid specific heat quadratic polynomial (cp_L=cp_La+cp_Lb*(T-TRef_cp_L)+cp_Lc*(T-TRef_cp_L)^2)
TRef_cp_L			TRef_cp_L [0 0 0 1 0 0 0] 273.15;
cp_La             	cp_La [0 2 -2 -1 0 0 0] 3495; 
cp_Lb             	cp_Lb [0 2 -2 -2 0 0 0] 0;
cp_Lc             	cp_Lc [0 2 -2 -3 0 0 0] 0;

// liquid thermal conductivity quadratic polynomial (k_L=k_La+k_Lb*(T-TRef_k_L)+k_Lc*(T-TRef_k_L)^2)
TRef_k_L			TRef_k_L [0 0 0 1 0 0 0] 273.15;
k_La         	 	k_La [1 1 -3 -1 0 0 0] 1.8372; // Equivalent thermal conductivity of PCM–metal foam composites
k_Lb         	 	k_Lb [1 1 -3 -2 0 0 0] 0;
k_Lc         	 	k_Lc [1 1 -3 -3 0 0 0] 0;

// kinematic viscosity (nu=1/(nua+nub*T+nuc*T^2))
TRef_nu				TRef_nu [0 0 0 1 0 0 0] 0.0;
nu              	nu [0 2 -1 0 0 0 0] 4.46e-06; // required, but will be overwritten during runtime
nua					nua [0 -2 1 0 0 0 0] 2.24215e5; // viscosity for T=283.18 K
nub					nub [0 -2 1 -1 0 0 0] 0;
nuc					nuc [0 -2 1 -2 0 0 0] 0;

// solid density polynomial (rho_S=rho_Sa+rho_Sb*T+rho_Sc*T^2)
TRef_rho_S			TRef_rho_S [0 0 0 1 0 0 0] 273.15;
rho_Sa				rho_Sa [1 -3 0 0 0 0 0] 870;
rho_Sb				rho_Sb [1 -3 0 -1 0 0 0] 0;
rho_Sc				rho_Sc [1 -3 0 -2 0 0 0] 0;

// solid specific heat quadratic polynomial (cp_S=cp_Sa+cp_Sb*(T-TRef_cp_S)+cp_Sc*(T-TRef_cp_S)^2)
TRef_cp_S			TRef_cp_S [0 0 0 1 0 0 0] 273.15;
cp_Sa             	cp_Sa [0 2 -2 -1 0 0 0] 4046; 
cp_Sb             	cp_Sb [0 2 -2 -2 0 0 0] 0;
cp_Sc             	cp_Sc [0 2 -2 -3 0 0 0] 0;

// solid thermal conductivity quadratic polynomial (k_S=k_Sa+k_Sb*(T-TRef_k_S)+k_Sc*(T-TRef_k_S)^2)
TRef_k_S			TRef_k_S [0 0 0 1 0 0 0] 273.15;
k_Sa             	k_Sa [1 1 -3 -1 0 0 0] 2; // Equivalent thermal conductivity of PCM–metal foam composites
k_Sb             	k_Sb [1 1 -3 -2 0 0 0] 0;
k_Sc             	k_Sc [1 1 -3 -3 0 0 0] 0;

TRef            	TRef [0 0 0 1 0 0 0] 288;
T_S             	T_S [0 0 0 1 0 0 0] 288;
T_L             	T_L [0 0 0 1 0 0 0] 293;
h_m             	h_m [0 2 -2 0 0 0 0] 199424;
DarcyConstant   	DarcyConstant [1 -3 -1 0 0 0 0] 1.0e5;
DarcyTerm_epsilon	DarcyTerm_epsilon [0 0 0 0 0 0 0] 1e-03;

// Metal foam parameters
e                   e [0 0 0 0 0 0 0] 0.98; // Porosity 
rou_metal           rou_metal [1 -3 0 0 0 0 0] 8960; // Metal density 
cp_metal            cp_metal [0 2 -2 -1 0 0 0] 390; // Metal specific heat capacity

// Accumulator parameters
P0_accu             P0_accu [1 -1 -2 0 0 0 0] 15e6; // Precharge pressure 
V0_accu             V0_accu [0 3 0 0 0 0 0] 5e-3; // Initial volume 
gamma               gamma   [0 0 0 0 0 0 0] 1.2; // Polytropic Exponent
Pele                Pele    [1 -1 -2 0 0 0 0] 20e6; // The pressure to start generating electricity

// Maximum volume change of PCM
Vexpanmax           Vexpanmax [0 3 0 0 0 0 0] 3.2e-3;
Vpcm_death          Vpcm_death [0 3 0 0 0 0 0] 0;

// The Relationship between Pressure and phase-change point of PCM
PRef                PRef [1 -1 -2 0 0 0 0] 1e5;
TPRefS              TPRefS [0 0 0 1 0 0 0] 285.45;
TP_kS               TP_kS [-1 1 2 1 0 0 0] 0.22571e-6;
TPRefL              TPRefL [0 0 0 1 0 0 0] 290.24;
TP_kL               TP_kL [-1 1 2 1 0 0 0] 0.16684e-6;
P_pcm               P_pcm [1 -1 -2 0 0 0 0] 15e6;
P_pcm0              P_pcm0 [1 -1 -2 0 0 0 0] 15e6;

// Convergence criteria for heat exchanger pressure calculation
residual_Pmin       residual_Pmin [0 0 0 0 0 0 0] 1e-6;

// These terms can be set arbitrarily and will be calculated automatically by the solver)
beta            	beta [0 0 0 -1 0 0 0] 0.89e-3; 
Vele                Vele    [0 3 0 0 0 0 0] 20e6; 
deltaTSL            deltaTSL [0 0 0 1 0 0 0] 4.27; 
P_pcm_pre           P_pcm_pre [1 -1 -2 0 0 0 0] 15e6;
residual_P          residual_P [0 0 0 0 0 0 0] 1;
// ************************************************************************* //
